In [1]:
import pandas as pd
import numpy as np

In [4]:
s = pd.Series(np.random.randn(10),
              index=[["a", "a", "a", "b", "b", "b", "c", "c", "d", "d"],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
#인덱스가 2층 구조로 구성됨

In [3]:
s

a  1   -1.000213
   2   -0.756293
   3   -1.157344
b  1   -1.372433
   2    1.393567
   3   -3.290635
c  1    0.641081
   2    0.685296
d  2    0.898390
   3   -0.398565
dtype: float64

In [5]:
s.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [6]:
s["b"]

1   -0.230288
2    2.021841
3    0.664535
dtype: float64

In [8]:
s["b":"c"]

b  1   -0.230288
   2    2.021841
   3    0.664535
c  1   -0.204682
   2   -0.155157
dtype: float64

In [9]:
s[("b",3)]

0.66453514578977213

In [12]:
s[:,2]

a   -0.274044
b    2.021841
c   -0.155157
d   -0.440958
dtype: float64

In [13]:
df = pd.DataFrame(np.arange(12).reshape((4, 3)),
                               index=[["a", "a", "b", "b"], 
                                      [1, 2, 1, 2]],
                               columns=[["Seoul", "Seoul", "Busan"],
                                        ["Green", "Red", "Green"]])
#인덱스, 컬럼 모두 계층적 인덱싱 가능하다

In [14]:
df

    Seoul     Busan
    Green Red Green
a 1     0   1     2
  2     3   4     5
b 1     6   7     8
  2     9  10    11

In [16]:
df.index.names=["key1","key2"]

In [17]:
df.columns.names=["city","color"]

In [18]:
df

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [19]:
df["Seoul"]

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [21]:
df[("Seoul","Green")]

key1  key2
a     1       0
      2       3
b     1       6
      2       9
Name: (Seoul, Green), dtype: int32

In [22]:
df.loc["a"]

city  Seoul     Busan
color Green Red Green
key2
1         0   1     2
2         3   4     5

In [23]:
df.loc[("a",1)]

city   color
Seoul  Green    0
       Red      1
Busan  Green    2
Name: (a, 1), dtype: int32

In [24]:
df.loc[("b",("Seoul","Red"))]

key2
1     7
2    10
Name: (Seoul, Red), dtype: int32

In [25]:
df.sort_index(axis=0, level=0)
#행방향으로 정렬하고 key1로 오름차순 정렬함

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [28]:
df.sort_index(axis=0, level=1)
#행방향으로 정렬하고 key2로 오름차순 정렬함

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
b    1        6   7     8
a    2        3   4     5
b    2        9  10    11

In [29]:
df.sort_index(axis=0, level="key2")

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
b    1        6   7     8
a    2        3   4     5
b    2        9  10    11

In [30]:
df.sort_index(axis=1, level=0)
#열 기준으로 정렬한다

city      Busan Seoul
color     Green Green Red
key1 key2
a    1        2     0   1
     2        5     3   4
b    1        8     6   7
     2       11     9  10

In [31]:
df.sort_index(axis=1, level=1)

city      Busan Seoul
color     Green Green Red
key1 key2
a    1        2     0   1
     2        5     3   4
b    1        8     6   7
     2       11     9  10

In [33]:
df.sort_values(by=("Busan", "Green"))
#부산 그린으로 오름차순으로 나온다

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [36]:
df.sum(axis=0,level=0)
#key1를 기준으로 더한다

city  Seoul     Busan
color Green Red Green
key1
a         3   5     7
b        15  17    19

In [35]:
df.sum(axis=0,level=1)
#key2를 기준으로 더한다

city  Seoul     Busan
color Green Red Green
key2
1         6   8    10
2        12  14    16

In [37]:
df

city      Seoul     Busan
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [39]:
df.mean(axis=1, level="color")
#열방향으로 color 컬럼의 평균을 구한다

color      Green  Red
key1 key2
a    1         1    1
     2         4    4
b    1         7    7
     2        10   10

In [40]:
df2 = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                    'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                    'd': [0, 1, 2, 0, 1, 2, 3]})

In [41]:
df2

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [46]:
df3 = df2.set_index(["c","d"])
# c, d를 인덱스로 내려서 정렬한다

In [45]:
df3

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [47]:
df2.set_index(["c","d"],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [48]:
df3

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [50]:
df3.reset_index()
#현존하는 모든 인덱스를 컬럼으로 올리고 기존 인덱스를 정수로 바꿈

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [51]:
df4 = pd.DataFrame(np.arange(6).reshape((2, 3)),
                   index=['Seoul', 'Busan'], 
                   columns=['one', 'two', 'three'])
df4.index.name = "city"
df4.columns.name = "number"

In [53]:
df4

number  one  two  three
city
Seoul     0    1      2
Busan     3    4      5

In [57]:
df5 = df4.stack()
#컬럼을 인덱스 하위로 내린다

In [58]:
df5

city   number
Seoul  one       0
       two       1
       three     2
Busan  one       3
       two       4
       three     5
dtype: int32

In [60]:
df5.unstack()
#하위 인덱스를 컬럼으로 올린다

number  one  two  three
city
Seoul     0    1      2
Busan     3    4      5

In [62]:
df5.unstack(level=0)
#0번 인덱스를 컬럼으로 올린다

city    Seoul  Busan
number
one         0      3
two         1      4
three       2      5

In [63]:
df5.unstack(level="city")

city    Seoul  Busan
number
one         0      3
two         1      4
three       2      5

In [64]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])
s3 = pd.concat([s1, s2], keys=["one", "two"])

In [66]:
s3

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [67]:
s3.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [68]:
df6 = pd.DataFrame({"left": df5, "right": df5 + 5},
                   columns=["left", "right"])
df6.columns.name = "side"

In [69]:
df6

side          left  right
city  number
Seoul one        0      5
      two        1      6
      three      2      7
Busan one        3      8
      two        4      9
      three      5     10

In [70]:
df6.unstack()

side   left           right
number  one two three   one two three
city
Seoul     0   1     2     5   6     7
Busan     3   4     5     8   9    10

In [71]:
df6.unstack(level="city")

side    left       right
city   Seoul Busan Seoul Busan
number
one        0     3     5     8
two        1     4     6     9
three      2     5     7    10

In [72]:
df6.unstack(level="city").stack(level="side")

city          Seoul  Busan
number side
one    left       0      3
       right      5      8
two    left       1      4
       right      6      9
three  left       2      5
       right      7     10